{
  "project": "treb-cli",
  "branchName": "ralph/namespace-discovery",
  "description": "Namespace Discovery for treb list - Show helpful hints about other namespaces when current namespace has no deployments",
  "userStories": [
    {
      "id": "US-001",
      "title": "Add namespace summary to ListDeployments use case",
      "description": "As a developer, I need the list use case to return information about other namespaces when the current query returns no results, so the renderer can display a discovery hint.",
      "acceptanceCriteria": [
        "Add OtherNamespaces map[string]int field to DeploymentListResult in internal/usecase/ports.go — maps namespace name to deployment count",
        "Add CurrentNamespace string and CurrentNetwork string fields to DeploymentListResult so the renderer knows the filter context",
        "When result.Deployments is empty, populate OtherNamespaces by calling repo.GetAllDeployments() and counting deployments grouped by namespace, filtered by current chain ID if uc.config.Network is set",
        "OtherNamespaces excludes the current namespace (already known to be empty)",
        "OtherNamespaces is nil when deployments are found (no extra work on the happy path)",
        "Unit tests cover: empty namespace with others available, empty namespace with no others, non-empty namespace (field stays nil), chain ID filtering applies to other-namespace counts",
        "Typecheck passes (go build ./...)",
        "make lint passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Render namespace discovery hint in table output",
      "description": "As a user running treb list in an empty namespace, I want to see which other namespaces have deployments so I can switch context.",
      "acceptanceCriteria": [
        "In RenderDeploymentList in internal/cli/render/deployments.go, when result.Deployments is empty and result.OtherNamespaces is non-empty, render a discovery hint instead of bare 'No deployments found'",
        "Hint includes: 'No deployments found in namespace \"<name>\"' with optional ' on <networkName> (<chainID>)' when network is set",
        "Hint lists other namespaces sorted alphabetically with deployment counts, e.g.: '  production  5 deployments'",
        "Hint ends with: 'Use --namespace <name> or `treb config set namespace <name>` to switch.'",
        "When OtherNamespaces is nil or empty, keep existing 'No deployments found' message unchanged",
        "Typecheck passes (go build ./...)",
        "make lint passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Include namespace discovery in JSON output",
      "description": "As a tool consumer, I need the JSON output to include namespace discovery data when the list is empty.",
      "acceptanceCriteria": [
        "In renderListJSON in internal/cli/list.go, when deployments list is empty and result.OtherNamespaces is non-empty, include 'otherNamespaces' map in JSON output alongside the empty 'deployments' array",
        "When deployments exist, omit otherNamespaces from JSON output entirely",
        "When no other namespaces have deployments, omit otherNamespaces from JSON output",
        "Create a new listJSONOutput struct wrapping the entries slice and optional OtherNamespaces field with omitempty",
        "Typecheck passes (go build ./...)",
        "make lint passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Integration tests for namespace discovery",
      "description": "As a developer, I need integration tests to verify the namespace discovery feature end-to-end.",
      "acceptanceCriteria": [
        "Add test case in test/integration/: deploy in namespace A via setup, run treb list in namespace B — hint shows namespace A with count",
        "Add test case: deploy in current namespace — no hint shown, normal table output",
        "Add test case: no deployments anywhere — shows 'No deployments found' with no hint",
        "Add test case: JSON output with --json includes otherNamespaces when current namespace is empty",
        "Golden files created for all new test cases (use -treb.updategolden)",
        "make integration-test passes",
        "Typecheck passes (go build ./...)"
      ],
      "priority": 4,
      "passes": true,
      "notes": ""
    }
  ]
}
